Repository: giellalt/corpus-fin
Catalog: tmx/smn/facta/samemusea_siida/ortografiat.html.tmx
Source language: fin
Languages: smn

source: Kieli
smn: Kielâ

source: Kirjoitustavat
smn: Čäällimvyevih

source: Kieli ja identiteetti
smn: Kielâ já identiteet

source: Kirjallisuus
smn: Kirjálâšvuotâ

source: Julkaistut teokset
smn: Almostittum kirjálâšvuotâ

source: 1. Elias Lönnrot kirjoitti vuonna 1854 artikkelin Ueber den Enarelappischen Dialekt, joka on ilmestynyt 4. osana teossarjassa Acta Societatis Scientiarum Fennicae.
smn: 1. Elias Lönnrot čaalij ive 1854 artikkel Ueber den Enarelappischen Dialekt, mii lii almostum 4. uássin kirjerááiđust Acta Societatis Scientiarum Fennicae.

source: Artikkelissa on inarinsaamen verbien ja nominien taivuskaavoja, tekstejä ja sanasto.
smn: Artikkelist láá anarâškielâ verbâi já nominij sujâttem maallih, teevstah já sánádâh.

source: Lönnrotin ortografia ei ole kovin looginen, eikä hän ilmeisesti ollut kuullut aivan tarkkaan kielimestariensa ääntämistä.
smn: Lönnrot ortografia ij lah uáli loogilâš, ige sun vaarâ lam kuullâm aaibâs tárkká kielâmiäštárijdis etâmijd: Ææc´e miij, kii læh olmin, paasotuvos tuu nommot!

source: Esimerkkinä Isä meidän -rukous:
smn: Adde miijen odne miij juöhe-pæivac´ læibem!

source: 2. E. W. Borg julkaisi vuonna 1857 kirjan Anar sämi kiela aapis kirje ja doktor Martti Lutherus Ucca katkismus.
smn: 2. E. W. Borg almostitij ive 1857 kirje Anar sämi kiela aapis kirje ja doktor Martti Lutherus Ucca katkismus.

source: (Inarinsaamen kielen aapiskirja ja tohtori Martti Lutheruksen Pieni katekismus.
smn: Mii Eec kote läh almest. Pasottum lävus Tu nommad Alda puodus Tuu wäldekoddad.

source: ) Siinä Isä meidän näytti seuraavalta:
smn: Adde miijan taan päiwi mii jyöche päiväli leipim.

source: 3. Inarin kirkkoherra Lauri Itkonen toimitti kirjat Katkismus 1902 ja Ráámmát Historja (raamatunhistoria) 1906. Jos vertaa ortografiaa edellisiin, niin muutos on merkittävä.
smn: 3. Aanaar kirkkohiärrá Lauri Itkonen toimâttij kiirjijd Katkismus 1902 já Ráámmát Historja 1906. Jis verdid ortografia ovdebáid, te tot muttum melgâd ennuv.

source: Kirjoitus näyttää vastaavan melko tarkasti puhetta.
smn: Čäällim oro västidmin sárnum viehâ tárkká.

source: Käytössä ovat nykykirjoitustavassakin esiintyvät č, š, đ, ŋ ja á.
smn: Aanoost láá pustaveh č, š, đ, ŋ já á, moh uáinojeh tááláá čäällimvyevist-uv.

source: Kirjoitustapa on melkein sama kuin vuosina 1934-1990 käytetty:
smn: Čäällimvyevih lii-uv masa siämmáš ko tot, mii kevttui ivij 1934-1990. Taa ovdâmerkkâ:

source: 4. Edellistä tarkempi on Erkki Itkosen laatima kirjoitustapa, joka oli käytössä vuosina 1934-1990. Sillä kirjoitettiin enimmäkseen Sabmelaš (Sápmelaš) -lehden inarinsaamenkieliset kirjoitukset, joita alkoi lehdessä ilmestyä loppuvuodesta 1934 alkaen.
smn: Tastko tuu lii väldikodde ja vyeimi ja kunnee nuuvhannaavuođast. 4. Ovdebáást täärhib lii Erkki Itkos rähtim čäällimvyehi, mii lâi aanoost ivij 1934-1990. Toin čállojii iänááš Sabmelaš (Sápmelaš) -loostâ anarâškielâliih čalluuh, moh almostuuškuottii loostâst loppâive 1934 rääjist.

source: 5. Nykyisessä kirjoitustavassa eräät äänteet merkitään aikaisempaa tarkemmin vastaamaan puhuttua kieltä.
smn: 5. Tááláá čäällimvyevist motomeh jienâduvah merkkejuvvojeh ovdebáást tärhibeht nuuvt, et toh västideh pyerebeht sarnum kielâ.

source: Muutokset olivat seuraavat: - eä merkitään iä, esim. eänui - iänui - oa merkitään uá, esim. koati - kuáti - takaista a- äännettä alettiin merkitä kirjaimella â;
smn: Muttoseh lijjii tágáreh: - eä čálloo iä, om. eänui - iänui - oa čálloo uá, om. koati - kuáti - tyehi- a -jienâdâh čalluuškuođij pustaváin â;

source: esim. kulma - kulmâ - j:llä merkittävää puolivokaalia ja sitä edeltävää i:tä alettiin merkitä loogisemmin: ij:iij, esim. nijbe: niijbán (veitsi: veitseen) - samoin v:llä merkittävää puolivokaalia ja sitä edeltävää u:ta: uv:uuv, esim. puvdâ: puuvdâst (kauppa: kaupassa).
smn: om. kulma - kulmâ - j:jn čállojeijee pelivookaal já i ton ovdiibeln čállojeh loogilubbooht: ij:iij, om. nijbe: niijbán - siämmáánáál v:in čállojeijee pelivookaal já u ton ovddiibeln čállojeh: uv:uuv, om. puvdâ: puuvdâst. 1934-1990 čäällimvyehi Pasottum leävus tuu nomma.

source: Inarinsaamen nykyinen ortografia on tietyiltä osin väljä.
smn: Anarâškielâ tááláš ortografia lii tiätu oosijn loožâs.

source: Esim. kaikkia murre-eroja ei ole normitettu, vaan hyväksyttäviä sanoja ja taivutuksia voi olla useampi kuin yksi.
smn: Om. puoh kuávlukielâi iäruh iä lah normâdum, mut toháliih säänih já suujâtmeh pyehtih leđe eenâb ko tuše ohtâ.

source: Oppikirjoissa kieltä kuitenkin yhtenäistetään.
smn: Oppâkiirjijn kielâ lii kuittâg pieijum eenâb oovtâdnáál.

source: 6. Erkki Itkonen on käyttänyt omaa, yleisestä kirjoitustavasta poikkeavaa merkintätapaa eräissä kielitieteen tekstikirjoissa ja sanakirjassaan Inarilappisches W örterbuch.
smn: 6. Erkki Itkonen lii kiävttám jieijâs čäällimvyevi, mii lii ereslágán ko almolâš čäällimvyehi. Tággáár čäällimvyehi lii motomijn kielâtiettuu teekstâkiirjijn já suu sänikirjeest Inarilappisches Wörterbuch.

source: Matti Morottaja
smn: Itkonen æænab ajn skīipa ooudast kuáysuj Taaa vaīin roozaj

source: Näyte Elias Lönnrotin teoksesta Ueber den Enarelappischen Dialekt vuodelta 1854.
smn: almolâš eenâb ain skiijpâ oovdâst kuávsui Taažâ vazzijn roosâi

source: Juhani Aikion kirje veljelleen Iisakille Königstedin kartanosta, Espoosta vuodelta 1910.
smn: Pärni-rohe (Juhani Aikio) reivâ viljâsis Sáár´ Iisán Königstedt kärdinist, Espoost ive 1910.
